Revit 2024 API
SiteLocation.ConvertToProjectTime Method
Converts local time or UTC time to project time.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DateTime ConvertToProjectTime(
	DateTime inputTime
)
Visual Basic
Public Function ConvertToProjectTime ( _
	inputTime As DateTime _
) As DateTime
Visual C++
public:
DateTime ConvertToProjectTime(
	DateTime inputTime
)
Parameters
inputTime
Type: System.DateTime
The input local time or UTC time.
Remarks
Daylight savings time is not considered during this conversion.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the inputTime's kind is neither Local nor Utc.
See Also
SiteLocation Class
Autodesk.Revit.DB Namespace